{
    "navbar": {
        "home": "Home",
        "about": "About me",
        "projects": "Projects and experience",
        "dark-theme": "Dark theme",
        "language": "Language"
    },
    "home": {
        "welcoming": "Hello world!",
        "my-name": "My name is Andrés Peláez",
        "title": "Home",
        "sections": {
            "my-knowledge": "My knowledge and abilities",
            "stand-out-projects": "Stand out projects"
        },
        "icons": {
            "full-stack": "Full stack software developer",
            "full-stack-description": "Knowledge in the JavaScript/TypeScript, Java, PHP, C# and Python programming languages",
            "bilingual": "Bilingual developer, born and raised in Colombia",
            "bilingual-description": "Writing, reading and conversational abilities in level C, native from Colombia",
            "experience-time": "4 years of working experience",
            "experience-time-description": "I have 4 years of working experience in the professional world of software development",
            "cicd": "Very familiar with CI/CD",
            "cicd-description": "I have experience working with Docker, GitLab CI/CD and GitHub Actions in order to deliver new features to customers"
        }
    },
    "projects": {
        "nda-warning": "Important: not every project I've worked on is here due to it may being considered as potentially sensitive to be shared.",
        "visit-page": "Visit website",
        "code-repo": "See code repository",
        "see-all": "See all the projects",
        "sipac": {
            "title": "Sistema de Información Para el Aseguramiento de la Calidad (SIPAC)",
            "description": "Project developed with the software development team in the Santiago de Cali University. I worked and lead many of the modules for this system, including: the automating of the creation of the academic emails using Google, and then Microsoft; Teacher Payroll Projection, new version of the projects platform for the DGI, Digital IDs and much more. New version and old version made in Laravel."
        },
        "apps": {
            "title": "Pagos En Línea (APPS)",
            "description": "New version of the project of Online Payments (Pagos En Línea) por the Santiago de Cali University, developed with the software development team. It is integrated with PlacetoPay and the existing Financial System in the institution, it also includes 100% english localization, made in Laravel."
        },
        "ssmanager": {
            "title": "Student School Manager (SSManager)",
            "description": "Final project created with a classmate of school. Developed for the San Francisco de Asís School when I was 16 years old, it allows the managing of the observations to the students of the school. Made in pure PHP when I was still learning."
        }
    },
    "about": {
        "title": "About me!",
        "myself": "Me and how I started programming",
        "myself-description": "A pleasure to meet you! My name is Andrés Felipe Estupiñán Peláez. I am a {years} years old software deveper born in the city of Santiago de Cali, Colombia. My interest in software development started since I was 10, but I never really started programming until I was 14 years old.<br/><br/>My story with programming started with SA-MP, a multiplayer mod for GTA San Andreas. I started developing a gamemode using the Pawn scripting language and I shared the server with my class friends.<br/><br/>I also started learning about Visual Basic, then Java and C#, then PHP and Python, and then Lua.<br/><br/>I studied in the National Learning Service (SENA) and, eventually in 2019, I got my first job in the Santiago de Cali University as a software developer, currently still there, now as a team leader. At the same time, I was studying systems engineering in the National Open and Distance University (UNAD).<br/><br/>Passionate of tech, respectful, friendly and kind, work well in a team and always with good disposition to learn something new. I take in knowledge quickly and adapt fast to situations.",
        "abilities": "Abilities and knowledge"
    },
    "not-found": "The page you were looking for has not been found."
}